Autodesk.Revit.UI.FormaStructuralSteelUtil.GetFabricationShape(Autodesk.Revit.DB.Element)
Returns fabrication geometry for an element considering the medium detail level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.UI.FormaStructuralSteelUtil
This class provides utilities for structural steel elements.
Since:
2018